# Автор: Марков М.М. Группа - ПМИ-3381

from Types import nat_0
from MUL_NN_N import MUL_NN_N

def test_mul_nn_n():
    # Тестирование функции MUL_NN_N

    # Малые значения
    assert MUL_NN_N(nat_0([1], 1), nat_0([2], 1)) == nat_0([2], 1)  # 1 * 2 = 2
    assert MUL_NN_N(nat_0([3], 1), nat_0([4], 1)) == nat_0([1, 2], 2)  # 3 * 4 = 12
    assert MUL_NN_N(nat_0([5], 1), nat_0([9], 1)) == nat_0([4, 5], 2)  # 5 * 9 = 45

    # Средние значения
    assert MUL_NN_N(nat_0([1, 2, 3], 3), nat_0([4, 5], 2)) == nat_0([5, 5, 3, 5], 4)  # 123 * 45 = 5535
    assert MUL_NN_N(nat_0([6, 7], 2), nat_0([8, 9], 2)) == nat_0([5, 9, 6, 3], 4)  # 67 * 89 = 5963
    assert MUL_NN_N(nat_0([4, 5, 6], 3), nat_0([7, 8, 9], 3)) == nat_0([3, 5, 9, 7, 8, 4], 6)  # 456 * 789 = 359784

    # Большие значения
    assert MUL_NN_N(nat_0([1, 2, 3, 4, 5], 5), nat_0([9, 8, 7, 6, 5], 5)) == \
           nat_0([1, 2, 1, 9, 2, 5, 3, 9, 2, 5], 10)  # 12345 * 98765 = 1219253925
    assert MUL_NN_N(nat_0([1] * 20, 20), nat_0([1, 2, 3], 3)) == \
           nat_0([1, 3] + [6] * 18 + [5, 3], 22)  # 111...111 (20 единиц) * 123 = 1366666666666666666653
    assert MUL_NN_N(nat_0([1] * 10000000, 10000000), nat_0([1, 2, 3], 3)) == \
           nat_0([1, 3] + [6] * (10000000 - 2) + [5, 3], 10000002)  # 111...111 (20 единиц) * 123 = 1366666666666666666653
    assert MUL_NN_N(nat_0([9] * 10000000, 10000000), nat_0([1, 2, 3], 3)) == \
           nat_0([1, 2, 2] + [9] * (10000000 - 3) + [8, 7, 7],
                 10000000 + 3)  # 111...111 (20 единиц) * 123 = 1366666666666666666653

    # Пограничные значения
    assert MUL_NN_N(nat_0([0], 1), nat_0([1, 2, 3], 3)) == nat_0([0], 1)  # 0 * 123 = 0
    assert MUL_NN_N(nat_0([1, 2, 3], 3), nat_0([0], 1)) == nat_0([0], 1)  # 123 * 0 = 0
    assert MUL_NN_N(nat_0([1], 1), nat_0([1], 1)) == nat_0([1], 1)  # 1 * 1 = 1
    assert MUL_NN_N(nat_0([1, 2], 2), nat_0([1], 1)) == nat_0([1, 2], 2)  # 12 * 1 = 12
    assert MUL_NN_N(nat_0([1], 1), nat_0([1, 2], 2)) == nat_0([1, 2], 2)  # 1 * 12 = 12

    print("Все тесты для MUL_NN_N пройдены успешно!")


if __name__ == "__main__":
    test_mul_nn_n()
